public class Main {
    public static void main(String[] args) {

        //Задание 1. Мили

        int ticket = 10000;
        int oneMileRub = 20;
        int totalMiles = ticket / oneMileRub;
        System.out.println(totalMiles + " - Это Ваши бонусные мили. Спасибо за покупку!");
        }

    }